#ifndef PropertyID_h_
#define PropertyID_h_
enum
{
	//---------------------------------------------------------------
	//下面是数据库保留的 (0 - 9)
//	PROPID_ACTOR_BASE			= 0,
//	PROPID_GUILD_BASE			= 0,
	
	PROPID_MAX_SYS_RESERVED 	= 9,	//<=9是数据库系统保留的
	
	//---------------------------------------------------------------
	//下面是服务器基本模块用
//	PROPID_ACCOUNT_BASE			= 10,	//DBServer专用

	PROPID_ACTOR_CLIENT_SETUP	= 11,	//11-20,是角色的客户端的设置
	
	//---------------------------------------------------------------
	//下面是魔法，技能用
//	PROPID_QSTSPELL_MIN			= 10000,	//1w
	
	//---------------------------------------------------------------
	//下面是好友关系模块用
//	PROPID_FRIEND_MIN			= 1000000,	//100w
	
	//---------------------------------------------------------------
	//下面是帮会模块用
//	PROPID_GUILD_MIN			= 2000000,	//200w
	//---------------------------------------------------------------
	//下面是成就模块用
//	PROPID_ACHIEVEMENT_MIN		= 3000000,	//300w
	//---------------------------------------------------------------
	//下面是邮件模块用
//	PROPID_MAIL_MIN				= 4000000,	//400w
	
};

#endif

